#### General imports

In [ ]:
import pandas as pd
import numpy as np

#### Excercise 1.1: Read titanic dataset

In [ ]:
titanic_df = pd.read_csv('https://raw.githubusercontent.com/ObozniyMaksym/HS_data/main/titanic.csv')
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

#### Exercise 1.2:Agregation on titanic dataset

In [ ]:
titanic_df.groupby(['Pclass']).mean()

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

In [ ]:
type(titanic_df.groupby(['Pclass']).mean())

pandas.core.frame.DataFrame

#### Exercise 1.3: Agregation on two levels

In [ ]:
aggr_df = titanic_df.groupby(['Pclass','SibSp']).mean()
aggr_df

              PassengerId  Survived        Age     Parch        Fare
Pclass SibSp
1      0       462.802920  0.562044  39.181416  0.270073   75.223356
       1       469.126761  0.746479  37.414154  0.422535   88.492021
       2       506.800000  0.800000  37.200000  0.800000  159.975840
       3       153.000000  0.666667  22.000000  2.000000  263.000000
2      0       434.350000  0.416667  31.934220  0.200000   15.532327
       1       461.672727  0.581818  27.363636  0.709091   28.385682
       2       476.875000  0.500000  19.125000  0.875000   44.468750
       3       727.000000  1.000000  30.000000  0.000000   21.000000
3      0       459.655271  0.236467  27.630201  0.148148    9.832689
       1       400.036145  0.325301  24.912698  0.819277   16.658487
       2       346.600000  0.333333  18.875000  0.466667   19.564993
       3       329.916667  0.083333   8.875000  1.250000   24.378483
       4       381.611111  0.166667   7.055556  1.500000   31.855556
       5       336.800000  0.000000  10.200000  2.000000   46.900000
       8       481.714286  0.000000        NaN  2.000000   69.550000

In [ ]:
type(aggr_df)

pandas.core.frame.DataFrame

In [ ]:
aggr_df.index

MultiIndex(levels=[[1, 2, 3], [0, 1, 2, 3, 4, 5, 8]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2], [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3, 4, 5, 6]],
           names=['Pclass', 'SibSp'])

In [ ]:
aggr_df.loc[ (3,8)]

PassengerId    481.714286
Survived         0.000000
Age                   NaN
Parch            2.000000
Fare            69.550000
Name: (3, 8), dtype: float64

In [ ]:
aggr_df.loc[ (3,8), 'Survived']

0.0

In [ ]:
aggr_df.loc[ (3,8), ['Survived']]

Survived    0.0
Name: (3, 8), dtype: float64

#### Exercise 1.3 Perform agregation on new set of parameters

In [ ]:
def my_groupby(df, ind, col):
  if df[col].loc[ind] > 19:
    return "Adults"
  elif df[col].loc[ind] > 12:
    return "Teenagers"
  else:
    return "Children"

In [ ]:
new_aggr = titanic_df.groupby(lambda x : my_groupby(titanic_df, x, 'Age')).mean()
new_aggr

           PassengerId  Survived    Pclass  ...     SibSp     Parch       Fare
Adults      452.052727  0.383636  2.149091  ...  0.332727  0.314545  35.559173
Children    434.699187  0.373984  2.609756  ...  0.930894  0.524390  24.788921
Teenagers   440.221053  0.410526  2.452632  ...  0.568421  0.400000  31.982414

[3 rows x 7 columns]